# ООП
# ООП - це парадигма програмування, яка базується на об'єктах та класах.
# Клас - це шаблон для створення об'єктів.
# Об'єкт - це екземпляр класу.
# Атрибути - це змінні, які визначені в класі.
# Методи - це функції, які визначені в класі.
# self - це обов'язковий параметр, який вказує на сам об'єкт.
# __init__ - це метод, який викликається при створенні об'єкта.
# Конструктор - це метод __init__.
# Наслідування - це можливість створювати новий клас на основі вже існуючого.
# super() - це функція, яка дозволяє викликати методи батьківського класу.
# Множинне наслідування - це можливість наслідувати властивості від більше ніж одного класу.
# Поліморфізм - це можливість використовувати методи одного і того ж імені в різних класах.
# Абстракція - це можливість приховувати деталі реалізації.
# Інкапсуляція - це можливість об'єднувати дані та методи в одному класі.
# Класи в Python називаються з великої літери.

class Product:
    # Конструктор
    def __init__(self, name, price):
        self.name = name
        self.price = price

    def __str__(self):
        return f'{self.name} - {self.price}'

# Singleton \ Одиничка
products =  Product('Phone', 1000)
print(products) # P hone - 1000