questions = {
    "Зумери": [
        {"question": "Що означає 'yeet'?",
         "options": ["Вітаю", "Викидаю/кидаю", "Люблю"],
         "answer": "Викидаю/кидаю"},
        {"question": "Як зумери називають 'роботу'?",
         "options": ["Халепа", "Гайка", "Грінда"],
         "answer": "Грінда"}
    ],
    "Бумери": [
        {"question": "Що означає 'дискета'?",
         "options": ["USB-накопичувач", "Зовнішній жорсткий диск", "Знімний носій даних у вигляді квадратної пластикової коробки"],
         "answer": "Знімний носій даних у вигляді квадратної пластикової коробки"},
        {"question": "Як бумери можуть назвати 'інтернет'?",
         "options": ["Всесвітня павутина", "Глобальна система", "Телеграф"],
         "answer": "Всесвітня павутина"}
    ],
    "Альфа": [
        {"question": "Що означає 'roblox'?",
         "options": ["Тип ігор", "Нова марка одягу", "Вид музики"],
         "answer": "Тип ігор"},
        {"question": "Як покоління Альфа може називати 'книги'?",
         "options": ["Паперові сторінки", "Сторінки", "Екрани з текстом"],
         "answer": "Паперові сторінки"}
    ]
}